In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [42]:
file_path=r'C:\Users\SHRI\Documents\DS\EDA\Visadataset.csv'
visa_df=pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [40]:
file_path=r'C:\Users\SHRI\Documents\DS\EDA\bank.csv'
pd.read_csv(file_path)

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [3]:
##To seperate the data in columns use ( sep=';' ) 

file_path=r'C:\Users\SHRI\Documents\DS\EDA\bank.csv'
bankdf=pd.read_csv(file_path,sep=';')
bankdf

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [ ]:
- shape

- size

- len

- columns

- dtypes

- isnull

- head

- tail

- info

In [45]:
visa_df.shape

(25480, 12)

In [43]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [46]:
len(visa_df)

25480

In [47]:
visa_df.size

305760

In [49]:
visa_df.head(5)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [50]:
visa_df.tail(10)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25470,EZYV25471,North America,Master's,Y,N,2272,1970,Northeast,516.4101,Hour,Y,Certified
25471,EZYV25472,Asia,High School,N,N,40224,1962,Island,75587.4200,Year,Y,Certified
25472,EZYV25473,Asia,High School,N,N,1346,2003,Midwest,76155.6000,Year,N,Certified
25473,EZYV25474,Asia,Bachelor's,Y,N,2421,2007,Northeast,22845.5600,Year,Y,Certified
25474,EZYV25475,Africa,Doctorate,N,N,2594,1979,Northeast,51104.7800,Year,Y,Certified
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [52]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [53]:
type(visa_df)

pandas.core.frame.DataFrame

In [54]:
type(visa_df.dtypes)

pandas.core.series.Series

**task 1**

- i want to seperate the cat and numerical columns

- cat columns in one list

- NUmerical columns in another list

In [55]:
visa_df.dtypes.keys()     ## visa_df.dtypes.keys().tolist()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [56]:
visa_df.dtypes.values    ## visa_df.dtypes.values.tolist()

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [58]:
#cols,dtypes

for i in dtype:
    if i == 'object':
        print(i)

NameError: name 'dtype' is not defined

In [60]:
cat=[]
numerical=[]
for i,j in zip(dtypes,cols):
    if j == 'object':
        cat.append(i)
    else:
        numerical.append(i)

print(cat)
print(numerical)

NameError: name 'dtypes' is not defined

In [24]:
cat=[j for i,j in zip (dtypes, cols)  if i =='object']
numerical=[j for i,j in zip (dtypes, cols)  if i !='object']
len(cat), len(numerical)

NameError: name 'dtypes' is not defined

In [61]:
visa_df
visa_df.dtypes
visa_df.dtypes.keys()
cols=visa_df.dtypes.keys().tolist()
dtypes=visa_df.dtypes.values.tolist()

## select dtypes

In [63]:
cat=visa_df.select_dtypes(include= 'object')   ## short cut for it

In [26]:
catr=visa_df.select_dtypes(include= 'object').columns
numerical=visa_df.select_dtypes(exclude= 'object').columns  ## for numerical

NameError: name 'visa_df' is not defined

**task 2 : covert series to dataframe**

In [28]:
dtypes = visa_df.dtypes
d1=pd.DataFrame(dtypes,columns=['data type'])

NameError: name 'visa_df' is not defined

In [29]:
dtypes = visa_df.dtypes
d1=pd.DataFrame(dtypes,columns=['data type'])
d1.reset_index().rename({'index':'Column'})     ## series to data frame

NameError: name 'visa_df' is not defined

In [30]:
visa_

NameError: name 'visa_' is not defined

In [31]:
visa_df.dtype.index

NameError: name 'visa_df' is not defined

In [32]:
visa_df.dtype.keys()

NameError: name 'visa_df' is not defined

In [ ]:
key = value
index= values

In [33]:
dict(visa_df.dtypes)

NameError: name 'visa_df' is not defined

**another method**

In [34]:
#### Another method

## if i have a two list can i create 
# 
cols=visa_df.dtypes.index.tolist()
dtypes=visa_df.values.tolist()
pd.DataFrame(zip(cols,dtype))

NameError: name 'visa_df' is not defined

## Selection of Data

In [35]:
visa_df.iloc[rows,columns]

visa_df.iloc[St:stp:end , St:stp:end]

NameError: name 'visa_df' is not defined

In [36]:
visa_df
## 100-105 row     100,101,102,103,104 ##  middle of rows to extract i want
## 3 : 6     3,4,5  
visa_df.iloc[100 : 105 , 3: 6]

NameError: name 'visa_df' is not defined

In [ ]:
visa_df.iloc[100 : 105 , 3: 6]   # 100 to 104 rows from 3 to 5 columns
visa_df.iloc[100 : 105 ]         # 100 to 104 rows fro all columns
visa_df.iloc[100]                # 100th rows series
visa_df.iloc[[100]]              # 100th row df
visa_df.iloc[[100,200,300]]           ## there is no order here we can dosplay ranmdomly rows
visa_df.iloc[[100,200,300] , 3 : 6]     ## only 3,6
visa_df.iloc[[100,200,300] , [1,5,9]]   ## 1st , 5th , 9th  column

## check it all do practice

In [ ]:
cols.index('unit_of_wage')    ##  write column name directly and find number of column

In [38]:
## replace iloc  by loc
## use directly column names here 
visa_df.loc[[100,200,300] , ['continent','no_of_employees','unit_of_wage']]

NameError: name 'visa_df' is not defined